Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: $numbers = range (1,20); srand ((float)microtime()*1000000); shuffle ($numbers); while (list (, $number) = each ($numbers)) {echo "$number ";}
es: $numeros = range (1,20); srand (time()); shuffle ($numeros); while (list(, $numero) = each ($numeros)) {echo "$numero ";}

source: See also arsort(), asort(), ksort(), rsort(), sort(), and usort().
es: Vea también: arsort(), asort(), ksort(), rsort(), sort() y usort().

source: This calculates the similarity between two strings as described in Oliver [1993].
es: Esta función calcula la similitud entre dos cadenas según se describe en Oliver [1993].

source: Note that this implementation does not use a stack as in Oliver 's pseudo code, but recursive calls which may or may not speed up the whole process.
es: Nótese que esta implementación no utiliza una pila como en el pseudo-código de Oliver, sino llamadas recursivas que pueden o no acelerar el proceso completo.

source: Note also that the complexity of this algorithm is O( N**3) where N is the length of the longest string.
es: Nótese también que la complejidad de este algoritmo es O( N**3), donde N es la longitud de la cadena más larga.

source: By passing a reference as third argument, similar_text() will calculate the similarity in percent for you.
es: Pasando una referencia como tercer argumento, similar_text() calculará para usted la similitud como porcentaje.

source: It returns the number of matching chars in both strings.
es: Devuelve el número de caracteres coincidentes en ambas cadenas.

source: See also asin(), cos(), tan() and deg2rad().
es: Vea también cos() y tan().

source: The sizeof() function is an alias for count().
es: Devueve el número de elementos de la matriz.

source: See also count().
es: Vea también: count()

source: The sleep() function delays program execution for the given number of seconds.
es: La función sleep retarda la ejecución del programa durante el número de seconds (segundos) dado.

source: See also usleep() and set_time_limit()
es: Véase también usleep().

source: Returns SNMP object value on success and FALSE on error.
es: Devuelve el valor de un objeto SNMP en caso de exito y FALSE en caso de error.

source: The snmpget() function is used to read the value of an SNMP object specified by the object_id.
es: La función snmpget() es usada para leer el valor de un objeto SNMP especificado por el object_id.

source: SNMP agent is specified by the hostname and the read community is specified by the community parameter.
es: El agente SNMP es especificado por el hostname y la comunidad lectora es especificada por el parametro community.

source: Returns the current value stored in the UCD Library for quick_print. quick_print is off by default.
es: Delvuele el valor actual almacenado en la biblioteca UCD para quick_print. quick_print está desactivado por defecto.

source: Above function call would return FALSE if quick_print is off, and TRUE if quick_print is on.
es: La llamada a la función superior podría devolver FALSE si quick_print está activo, y TRUE si quick_print está activo.

source: snmp_get_quick_print() is only available when using the UCD SNMP library.
es: snmp_get_quick_print() está solamente disponible cuando estemos usando la biblioteca UCD SNMP.

source: This function is not available when using the Windows SNMP library.
es: Esta función no está disponible cuando estemos usando la biblioteca Windows SNMP.

source: See: snmp_set_quick_print() for a full description of what quick_print does.
es: Ver: snmp_get_quick_print() para una descripción completa de lo que hace quick_print.

source: SNMP functions
es: Funciones SNMP

source: Sets the specified SNMP object value, returning TRUE on success and FALSE on error.
es: Establece el valor especificado para el objeto SNMP, devolviendo TRUE en caso de exito o FALSE en caso de error.

source: The snmpset() function is used to set the value of an SNMP object specified by the object_id.
es: La función snmpset() es usada para establecer el valor de un objeto SNMP especificado por el object_id.

source: Sets the value of quick_print within the UCD SNMP library.
es: Establece el valor de quick_print con la biblioteca UCD SNMP.

source: When this is set (1), the SNMP library will return'quick printed 'values.
es: Cuando esto está establecido (1), la biblioteca SNMP devolverá valores 'quick printed '.

source: This means that just the value will be printed.
es: De esta manera sólo el valor será impreso.

source: When quick_print is not enabled (default) the UCD SNMP library prints extra information including the type of the value (i.e.
es: Ej.

source: IpAddress or OID).
es: IPAddress o OID).

source: Additionally, if quick_print is not enabled, the library prints additional hex values for all strings of three characters or less.
es: Adicionalmente, si quick_print no está activado, la biblioteca imprime valores hexadecimales adicionales para todas las cadenas de 3 o menos caracteres.

source: Setting quick_print is often used when using the information returned rather then displaying it.
es: El ajuste de quick_print es generalmente usado cuando usando la información devuelta con anterioridad se muestra.

source: The first value printed might be: 'Timeticks: (0) 0:00:00.00', whereas with quick_print enabled, just '0:00:00.00' would be printed.
es: El primer valor impreso debe de ser: 'Timeticks: (0) 0:00:00.00', donde qick_print se activa, solo se imprimira '0:00:00.00'.

source: By default the UCD SNMP library returns verbose values, quick_print is used to return only the value.
es: Por defecto la biblioteca UCD SNMP devuelve valores detallados, quick_print es usado para devolver solamente el valor.

source: Currently strings are still returned with extra quotes, this will be corrected in a later release.
es: Las cadenas son mantenidas normalmente con comillas extra, esto será corregido en versiones posteriores.

source: snmp_set_quick_print() is only available when using the UCD SNMP library.
es: snmp_get_quick_print() está sólo disponible cuando estemos usando la biblioteca UCD SNMP.

source: Returns an array of SNMP object values starting from the object_id as root and FALSE on error.
es: Devuelve una matriz de valores de objetos SMNP comenzando por el object_id() como raíz y FALSE en caso de error.

source: snmpwalk() function is used to read all the values from an SNMP agent specified by the hostname.
es: La función snmpwalk() es usada para leer todos los valores de un agente SNMP especificado por el hostname.

source: Community specifies the read community for that agent.
es: Community especifica la comunidad lectora para el agente.

source: A NULL object_id is taken as the root of the SNMP objects tree and all objects under that tree are returned as an array.
es: Un object_id nulo se toma como la raíz del arbol de los objetos SNMP y todos los objetos por debajo de ese arbol son devueltos como una matriz.

source: If object_id is specified, all the SNMP objects below that object_id are returned.
es: Si object_id es especificado, todos los objetos SNMP por debajo de object_id son devueltos.

source: Above function call would return all the SNMP objects from the SNMP agent running on localhost.
es: Encima de una función de llamada podrían devolverse todos los objetos SNMP del agente SNMP en ejecución en el servidor local.

source: One can step through the values with a loop
es: Uno puede pasar por todos los valores con un bucle.

source: Returns an associative array with object ids and their respective object value starting from the object_id as root and FALSE on error.
es: Devuelve una matriz asociativa con los identificadores de los objetos y sus respectivos valores comenzando por el object_id como raíz y FALSE en caso de error.

source: snmpwalkoid() function is used to read all object ids and their respective values from an SNMP agent specified by the hostname.
es: La función snmpwalkoid() es usada para leer todos los identificadores de objetos y sus respectivos valores de un agente SNMP especificado por el nombre del servidor.

source: The existence of snmpwalkoid() and snmpwalk() has historical reasons.
es: La existencia de snmpwalkoid() y snmpwalk() tiene razones historicas.

source: Both functions are provided for backward compatibility.
es: Ambas funciones son proporcionadas para compatibilidad hacia atrás.

source: Returns TRUE on success or FALSE on failure. socket_getpeername() may also return FALSE if the socket type is not any of AF_INET or AF_UNIX, in which case the last socket error code is not updated.
es: Devuelve TRUE si todo fue bien, FALSE en caso de fallo. socket_getpeername() may also return FALSE if the socket type is not any of AF_INET or AF_UNIX, in which case the last socket error code is not updated.

source: Returns TRUE on success or FALSE on failure. socket_getsockname() may also return FALSE if the socket type is not any of AF_INET or AF_UNIX, in which case the last socket error code is not updated.
es: Devuelve TRUE si todo fue bien, FALSE en caso de fallo. socket_getsockname() may also return FALSE if the socket type is not any of AF_INET or AF_UNIX, in which case the last socket error code is not updated.

source: Example 1. socket_strerror() example
es: Ejemplo 1. socket_strerror() example

source: The old_function statement allows you to declare a function using a syntax identical to PHP / FI2 (except you must replace'function 'with'old_function'.
es: La instrucción old_function permite declarar una función usando una sintaxis idéntica a la de PHP / FI2 (excepto que debes reemplazar 'function 'por 'old_function').

source: This is a deprecated feature, and should only be used by the PHP / FI2 - PHP 3 convertor.
es: Es una característica obsoleta, y debería ser usada únicamente por el conversor PHP / FI2 - PHP3.

source: Functions declared as old_function cannot be called from PHP 's internal code.
es: Las funciones declaradas como old_function no pueden llamarse desde el código interno de PHP.

source: Among other things, this means you can' t use them in functions such as usort(), array_walk(), and register_shutdown_function().
es: Entre otras cosas, esto significa que no puedes usarlas en funciones como usort(), array_walk(), y register_shutdown_function().

source: You can get around this limitation by writing a wrapper function (in normal PHP 3 form) to call the old_function.
es: Puedes solventar esta limitación escribiendo un "wrapper" (en PHP3 normal) que a su vez llame a la función declarada como old_function.

source: Variable functions
es: Funciones variable

source: Example 1. sort() example
es: Esta función ordena una matriz.

source: The fruits have been sorted in alphabetical order.
es: Ejemplo 1.

source: Sorting type flags:
es: Ejemplo de sort()

source: See also arsort(), asort(), ksort(), natsort(), natcasesort(), rsort(), usort(), array_multisort(), and uksort().
es: $frutas = array ("limón", "naranja", "plátano", "manzana"); sort ($frutas); for (reset ($frutas); $clave = key ($frutas); next ($frutas)) {echo "frutas[$clave] = ".$frutas[$clave] ."\n";}

source: Calculates the soundex key of str.
es: Calcula la clave soundex de cad.

source: Soundex keys have the property that words pronounced similarly produce the same soundex key, and can thus be used to simplify searches in databases where you know the pronunciation but not the spelling.
es: Las claves soundex tienen la propiedad de que las palabras que se pronuncian de forma parecida tienen la misma clave, de modo que se pueden usar para simplificar la búsqueda en las bases de datos cuando se conoce la pronunciación pero no la transcripción.

source: This soundex function returns a string 4 characters long, starting with a letter.
es: Esta función soundex devuelve una cadena de 4 caracteres que comienza por una letra.

source: This particular soundex function is one described by Donald Knuth in "The Art Of Computer Programming, vol.
es: Esta función soundex en particular es la descrita por Donald Knuth en "The Art Of Computer Programming, vol.

source: Soundex Examples
es: Ejemplos de Soundex

source: See also levenshtein(), metaphone(), and similar_text().
es: soundex ("Euler") == soundex ("Ellery") == 'E460'; soundex ("Gauss") == soundex ("Ghosh") == 'G200'; soundex ("Knuth") == soundex ("Kant") == 'H416'; soundex ("Lloyd") == soundex ("Ladd") == 'L300'; soundex ("Lukasiewicz") == soundex ("Lissajous") == 'L222';

source: If limit is set, the returned array will contain a maximum of limit elements with the last element containing the whole rest of string.
es: Devuelve un array de cadenas, cada una de las cuales es una subcadena de string formada al dividir esta en los límites formados por la expresión regular pattern.

source: If an error occurs, split() returns FALSE.
es: Si ocurre un error, devuelve un valor falso.

source: Example 1. split() Example
es: Para obtener los cinco primeros campos de una línea de / etc / passwd:

source: list( $user,$pass,$uid,$gid,$extra)= split (" :", $passwd_line, 5);
es: Ejemplo 1. split() example

source: If there are n occurrences of pattern, the returned array will contain n +1 items.
es: $passwd_list = split( ":", $passwd_line, 5);

source: Of course, this is also true if string is empty.
es: Para examinar una fecha que puede estar delimitada por barras, puntos o guiones:

source: To parse a date which may be delimited with slashes, dots, or hyphens:
es: Ejemplo 2. split() example

source: $date = "04 / 30 / 1973"; / / Delimiters may be slash, dot, or hyphen list ($month, $day, $year) = split ('[ /. -]', $date); echo "Month: $month; Day: $day; Year: $year br \n";
es: $date = "04 / 30 / 1973"; / / Los delimitadores pueden ser barras, puntos o guiones list ($month, $day, $year) = split ('[ /. -]', $date); echo "Month: $month; Day: $day; Year: $year br \n";

source: Note that pattern is case-sensitive.
es: Observar que pattern distingue entre mayúsculas y minúsculas.

source: Note that if you don' t require the power of regular expressions, it is faster to use explode(), which doesn't incur the overhead of the regular expression engine.
es: Observar que si no se necesita la potencia de las expresiones regulares, es más rápido utilizar explode(), que no carga el motor de expresiones regulares.

source: For users looking for a way to emulate Perl' s @chars = split('', $str) behaviour, please see the examples for preg_split().
es: Por favor, observar que pattern es una expresión regular.

source: If you want to split on any of the characters which are considered special by regular expressions, you 'll need to escape them first.
es: Si se quiere dividir con alguno de los caracteres especiales de las expresiones regulares, se necesita protegerlo antes.

source: If you think split() (or any other regex function, for that matter) is doing something weird, please read the file regex.7, included in the regex / subdirectory of the PHP distribution.
es: Si pareciera que split() (o cualquier otra función de regex) está haciendo algo irregular, léase el archivo regex.7, incluido en el subdirectorio regex de la distribución de PHP.

source: It' s in manpage format, so you'll want to do something along the lines of man / usr / local / src / regex / regex.7 in order to read it.
es: Está en formato de página de manual, por lo que para leerlo es necesaria una orden como man / usr / local / src / regex / regex.7.

source: See also: preg_split(), spliti(), explode(), implode(), chunk_split(), and wordwrap().
es: Ver también: explode() e implode().

source: Returns a string produced according to the formatting string format.
es: Devuelve una cadena producida de acuerdo a la cadena de formato.

source: The format string is composed of zero or more directives: ordinary characters (excluding%) that are copied directly to the result, and conversion specifications, each of which results in fetching its own parameter.
es: La cadena de formato está compuesta por cero o más directivas: caracteres ordinarios (excepto%) que son copiados directamente al resultado, y especificaciones de conversión, cada una de las cuales provoca la obtención de su propio parámetro.

source: This applies to both sprintf() and printf().
es: Esto se aplica tanto a sprintf() como a printf().

source: Each conversion specification consists of a percent sign (%), followed by one or more of these elements, in order:
es: Cada especificación de conversión consiste en uno de estos elementos, por orden:

source: This may be a space character or a 0 (zero character).
es: Un especificador de relleno opcional que indica qué caracter se utilizará para rellenar el resultado hasta el tamaño de cadena correcto.

source: The default is to pad with spaces.
es: Este puede ser un espacio o un 0 (caracter cero).

source: An alternate padding character can be specified by prefixing it with a single quote (').
es: El valor por defecto es rellenar con espacios.

source: An optional alignment specifier that says if the result should be left-justified or right-justified.
es: Un caracter de relleno alternativo se puede especificar prefijándolo con una comilla simple (').

source: The default is right-justified; a - character here will make it left-justified.
es: Vea los ejemplos más abajo.

source: An optional precision specifier that says how many decimal digits should be displayed for floating-point numbers.
es: Un especificador de alineación opcional que indica si el resultado debe ser alineado a la izquierda o a la derecha.

source: This option has no effect for other types than float. (Another function useful for formatting numbers is number_format().)
es: Por defecto se alinea a la derecha; un caracter - aquí lo justificará a la izquierda.

source: Possible types:
es: Un número opcional, un especificador de ancho que dice el número de caracteres (mínimo) en que debería resultar esta conversión.

source: No argument is required.
es: Un especificador de precisión opcional que indica cuántos dígitos decimales deben mostrarse para los números en coma flotante.

source: c - the argument is treated as an integer, and presented as the character with that ASCII value.
es: Esta opción no tienen efecto para otros tipos que no sean double. (Otra función útil para formatear números es number_format()).

source: u - the argument is treated as an integer, and presented as an unsigned decimal number.
es: Un especificador de tipo que indica el tipo a usar para tratar los datos de los argumentos.

source: f - the argument is treated as a float, and presented as a floating-point number.
es: Los tipos posibles son:

source: o - the argument is treated as an integer, and presented as an octal number.
es: % - un caracter literal de porcentaje.

source: s - the argument is treated as and presented as a string.
es: No se precisa argumento.

source: x - the argument is treated as an integer and presented as a hexadecimal number (with lowercase letters).
es: b - el argumento es tratado como un entero y presentado como un número binario.

source: X - the argument is treated as an integer and presented as a hexadecimal number (with uppercase letters).
es: c - el argumento es tratado como un entero, y presentado como el caracter con dicho valor ASCII.

source: As of PHP version 4.0.6 the format string supports argument numbering / swapping.
es: d - el argumento es tratado como un entero y presentado como un número decimal.

source: $format = "There are %d monkeys in the %s"; printf($format,$num,$location);
es: o - el argumento es tratado como un entero, y presentado como un número octal.

source: Argument swapping
es: s - el argumento es tratado como una cadena y es presentado como tal.

source: $format = "The %2\$s contains %1\$d monkeys"; printf($format,$num,$location);
es: X - el argumento es tratado como un entero y presentado como un número hexadecimal (con mayúsculas).

source: $format = "The %2\$s contains %1\$d monkeys.
es: Ejemplo 1.

source: That' s a nice %2\$s full of %1\$d monkeys ."; printf($format, $num, $location);
es: Ejemplo de sprintf(): enteros rellenos con ceros

source: See also printf(), sscanf(), fscanf(), vsprintf(), and number_format().
es: $fechaiso = sprintf ("%04d-%02d-%02d", $anno, $mes, $dia);

source: Example 5. sprintf(): zero-padded integers
es: Ejemplo 2.

source: $isodate = sprintf( "%04d-%02d-%02d", $year, $month, $day);
es: Ejemplo de sprintf(): formateando monedas

source: $money1 = 68.75; $money2 = 54.35; $money = $money1 + $money2; / / echo $money will output "123.1"; $formatted = sprintf("%01.2f", $money); / / echo $formatted will output "123.10 "
es: $pelas1 = 68.75; $pelas2 = 54.35; $pelas = $pelas1 + $pelas2; / / echo $pelas mostrará "123.1"; $formateado = sprintf ("%01.2f", $pelas); / / echo $formateado mostrará "123.10 "

source: Returns a valid regular expression which will match string, ignoring case.
es: Devuelve una expresión regular válida que coincide con string sin distinguir mayúsculas y minúsculas.

source: This expression is string with each character converted to a bracket expression; this bracket expression contains that character's uppercase and lowercase form if applicable, otherwise it contains the original character twice.
es: Esta expresión es string con cada carácter convertido a una expresión entre corchetes que contiene el carácter en mayúscula y minúscula, si es posible; en caso contrario, contiene el carácter original dos veces.

source: Example 1. sql_regcase() Example
es: Ejemplo 1. sql_regcase() example

source: This can be used to achieve case insensitive pattern matching in products which support only case sensitive regular expressions.
es: Se puede utilizar para lograr coincidencias que no diferencien mayúsculas de minúsculas en productos que sólo soportan expresiones regulares que sí distinguen.

source: Semaphore, Shared Memory and IPC Functions
es: Funciones Semáforo y de memoria compartida

source: See also rand(), getrandmax() and mt_srand().
es: Vea también rand(), getrandmax(), mt_rand(), mt_srand() y mt_getrandmax().

source: Any type may be returned, including lists and objects.
es: Los valores se retornan usando la instrucción opcional return.

source: See return() for more information.
es: Puede devolverse cualquier tipo de valor, incluyendo listas y objetos.

source: You can 't return multiple values from a function, but similar results can be obtained by returning a list.
es: function square ($num) {return $num * $num;} echo square (4); / / saca '16 '.

source: To return a reference from a function, you have to use the reference operator in both the function declaration and when assigning the returned value to a variable:
es: No puedes devolver múltiples valores desde una función, pero un efecto similar se puede conseguir devolviendo una lista.

source: If only two parameters were passed to this function, the values parsed will be returned as an array.
es: La función sscanf() es la función de entrada análoga de printf(). sscanf() lee del parámetro de cadena cad y lo interpreta según el formato especificado.

source: Any whitespace in the format string matches any whitespace in the input string.
es: Si sólo se pasan dos parámetros a esta función, los valores devueltos se harán en una matriz.

source: This means that even a tab \t in the format string can match a single space character in the input string.
es: Ejemplo de sscanf()

source: / / getting the serial number $serial = sscanf( "SN / 2350001" ,"SN / %d"); / / and the date of manufacturing $mandate = "January 01 2000"; list($month, $day, $year) = sscanf($mandate ,"%s %d %d"); echo "Item $serial was manufactured on: $year -".substr($month,0,3) ."-$day\n";
es: Ejemplo 2.

source: Example 2. sscanf() - using optional parameters
es: Ejemplo de sscanf() - usando parámetros opcionales
